{
    "english": "English",
    "persian": "Persian",
    "my_name": "Amirhossein Fazli",
    "me": "Me",
    "job": "Full-stack programmer",
    "short_description": "I am a Full-stack programmer and I am ready to implement your business idea!",
    "about_me": "About me",
    "my_skills": "My skills",
    "my_services": "My services",
    "my_portfolios": "My portfolios",
    "contact_me": "Contact me",
    "fullname": "Fullname",
    "age": "Age",
    "country": "Country",
    "my_country": "Iran",
    "city": "City",
    "my_city": "east-azarbijan - Marand",
    "address": "Address",
    "my_address": "bonab-e-jadid - Imam St. - Bakhshemandi alley - first ten meters - Fazli house",
    "status": "Status",
    "my_status": "Ready",
    "languages": "Languages",
    "freamworks": "Freamworks",
    "databases": "Databases",
    "os": "Operating system",
    "other": "Others",
    "mobile": "Mobile",
    "interview": {
        "inspire": {
            "ask": "What inspired you to become a programmer?",
            "answer": [
                "I think my interest in creating was the main reason why I became a programmer. Before programming, I was interested in electronics. Because I could create a product in this field as well and I enjoy this work. Finally, in 2017 I started programming by learning PHP."
            ]
        },
        "enjoy_in_programming": {
            "ask": "What do you enjoy most about programming?",
            "answer": [
                "I am happy to be able to communicate with the hardware of the devices. In a way, it gives me a sense of power. Also, because I create new products by programming, I enjoy it."
            ]
        },
        "most_proficient": {
            "ask": "What programming languages are you most proficient in?",
            "answer": [
                "My most mastery is in the Front-end section in the Vue and Svelte framework. Because both are simple, and that learning the two was for me before the framework is not ineffective.",
                "Also, on the back-end side, I have the most mastery in PHP and JavaScript. I have mostly used Laravel framework in PHP.",
                "With all this, it doesn't mean that I don't master other languages and other frameworks. Only in the languages and frameworks mentioned, I have more experience."
            ]
        },
        "up_to_date": {
            "ask": "How do you stay up-to-date on the latest programming languages, frameworks, and best practices? ",
            "answer": [
                "By reading the blog of languages and frameworks and also following their page on social pages, I keep track of new versions and features. Also, by studying the documents and also their Release page, I study the new features of the technologies."
            ]
        },
        "goals": {
            "ask": "What are some of your programming-related goals and dreams for the future?",
            "answer": [
                "The biggest goal I have in programming right now is to create a cross-platform UI Toolkit library that can be implemented in embedded."
            ]
        },
        "advice": {
            "ask": "What advice would you give to someone just starting out in programming?",
            "answer": [
                "I would like to say that programming has many challenges and issues. Therefore, if you are not interested in this job, do not waste your time.",
                "Take care of your health and finish the path you have chosen based on the road map that other people have already written. Use the opinions and experiences of experienced people in your field."
            ]
        },
        "impact": {
            "ask": "How has programming impacted your life?",
            "answer": [
                "The advice of Steve Jobs applies more to me in this case. They say: Everyone should learn computer programming nowadays. Because programming teaches you how to think.",
                "Programming has changed the way I think and make decisions when facing various challenges in life. I prefer rational decision to emotional decision."
            ]
        },
        "programming_future": {
            "ask": "What do you think the future holds for the programming field?",
            "answer": [
                "In my opinion, programmers are the gods of computers. With the development of the digital field, and with the use of new technologies, the need for programmers is increasing day by day. I see the future of programming very well."
            ]
        },
        "other_interests": {
            "ask": "Outside of programming, what other interests or hobbies do you have?",
            "answer": [
                "I am very interested in blockchain and electronics. I really like everything to be decentralized on the Internet. Because the security of people is provided on the Internet.",
                "I like futsal and I go to futsal once a week. I am also interested in reading books."
            ]
        },
        "good_programmer": {
            "ask": "What do you think makes a good programmer? What skills and qualities are most important?",
            "answer": [
                "In my opinion, a good programmer is someone who has written his code according to existing standards. Comment the codes and use design patterns as much as possible. Also, write tests for your codes."
            ]
        },
        "debugging": {
            "ask": "How do you approach debugging code? Do you have a systematic process?",
            "answer": [
                "When encountering a bug, to find it, I first identify the codes that are involved in the problem and check line by line to find the code that causes the problem. Of course, in this way, I use the debugging tools available in that language."
            ]
        },
        "resources_community": {
            "ask": "What programming resources or communities do you find most valuable?",
            "answer": [
                "In the first place, I believe that no source can be better than the official source (official documentation). Video resources and books are also very good.",
                "Stackoverflow, Reddit, Telegram and Discord communities help me a lot."
            ]
        }
    },
    "bootstrap": {
        "title": "Bootstrap",
        "value": "The best and most popular user interface library for fast and responsive site building is undoubtedly Bootstrap ... This library is extremely powerful and extensible and can be customized with Sass ..."
    },
    "javascript": {
        "title": "Javascript",
        "value": "At the very beginning, I was learning this language in the front-end. But later, at an advanced level, I learned this language and now I use it both in the front-end and in the back-end ..."
    },
    "jquery": {
        "title": "Jquery",
        "value": "It is one of the most common JavaScript libraries ... This library has an interesting slogan that says: write less, do more! The amount of code written with this library is much less than VanillaJS or raw JavaScript ..."
    },
    "laravel": {
        "title": "Laravel",
        "value": "Laravel is an incredibly powerful web framework. This framework has extremely high development power ... literally, in the shortest possible time, the most complex projects can be implemented with it ..."
    },
    "linux": {
        "title": "Linux",
        "value": "Linux is a family of Unix-like open source operating systems ... distributions that use the Linux kernel are literally perfect for developers ... it has great security ... all the development tools in it It is up to date and any tool we want is available ..."
    },
    "mysql": {
        "title": "MySql",
        "value": "It is an open source and powerful database that has been one of the best databases for several years and has left good statistics ... it uses SQL language for its queries and is widely used in web applications ..."
    },
    "php": {
        "title": "PHP",
        "value": "The first language I learned when I started programming is PHP. Because php is focused on simplicity and also has a very good community. Also, complex websites can be easily implemented with this lovely language ..."
    },
    "postgresql": {
        "title": "Postgresql",
        "value": "An incredibly powerful database, open source and completely free! This database has very good features and uses the SQL language for its queries ... it can store all kinds of advanced information and has excellent performance features that can be compared to expensive databases!"
    },
    "react": {
        "title": "React",
        "value": "I use React to create powerful UIs for the web. Also, due to its large community, React has been used in many reputable companies around the world ..."
    },
    "rust": {
        "title": "Rust",
        "value": "I started learning this language in 2022. For this reason, I like this language, which, in addition to being a modern language, produces safe and efficient software and allows me to manage memory. And it also offers performance that can compete with C ..."
    },
    "sass": {
        "title": "Sass",
        "value": "Sass is an incredibly powerful preprocessor for css. In all the projects I write, I use sass instead of css ... the amount of code is extremely less and with the least amount of coding, most things can be done ..."
    },
    "svelte": {
        "title": "Svelte",
        "value": "Svelte is a wonderful compiler! This compiler produces powerful UIs. The output it produces is extremely light and less bulky than its competitors ... I use this modern compiler to produce light and compact UIs, while having a lot of power ..."
    },
    "tailwind": {
        "title": "Tailwind CSS",
        "value": "A wonderful and lovely styling tool that provides what it takes to develop an attractive and beautiful site ... We will never reinvent the existing wheel ... Tailwind, basic features required provides for creating themes and makes development faster ..."
    },
    "typescript": {
        "title": "Typescript",
        "value": "Most of the problems that existed in JavaScript were caused by types ... I use TypeScript in order to produce programs that do not have unexpected errors in the future. I write almost all the projects that I want to write with JavaScript in this language ..."
    },
    "vue": {
        "title": "Vue",
        "value": "Vue is a powerful framework with a very good ecosystem. It is easy to develop and can produce powerful UIs with it. I use this framework in frontend and desktop applications ..."
    },
    "dart": {
        "title": "Dart",
        "value": "Dart was known as an incredibly powerful language for creating UI for any platform. I make mobile applications (android & ios) and desktop applications (windows & mac & linux) from this language and with the help of the Flutter framework."
    },
    "flutter": {
        "title": "Flutter",
        "value": "Flutter is an open source framework created by Google for building cross-platform applications. You can have the most beautiful mobile and desktop application at the lowest cost and create a great experience for your users!"
    },
    "wasm": {
        "title": "WebAssembly",
        "value": "WebAssembly is a low-level language that runs in a binary format in the browser ... one of the distinctive features of this language is its speed ... I write the front-end code of the website with the Rust language and the output from it I get WebAssembly ..."
    },
    "front_end": {
        "label": "Front-end",
        "description": "We will design your website template in a responsive and user-friendly way with your desired features ..."
    },
    "back_end": {
        "label": "Back-end",
        "description": "We make the core and brain of your website with the format you like, in a scalable and efficient way ..."
    },
    "telegram_bot": {
        "label": "Telegram bot",
        "description": "We design functional and customized robots according to your needs using the best methods of robot development ..."
    },
    "mobile_service": {
        "label": "Mobile Application",
        "description": "We are ready to write your business application on Android and iOS mobile platforms!"
    },
    "education": "Education",
    "diploma": {
        "label": "Diploma",
        "description": "I received my diploma from Shahid Beheshti School in Marand city in the field of mathematics and physics ..."
    },
    "2023": "2023",
    "validation_errors": {
        "name": {
            "required": "The name field is required!"
        },
        "email": {
            "required": "The Email field is required!",
            "invalid": "The email is invalid!"
        },
        "email_or_phone": "The email or phone number is required!",
        "phone": {
            "required": "The phone number field is required!"
        },
        "message": {
            "required": "The message field is required!"
        },
        "captcha": {
            "required": "Solving captcha is required!",
            "invalid": "Captcha is invalid!"
        }
    },
    "form_contact": {
        "result": {
            "loading": "Sending ... Please wait a few moments ...",
            "success": "Your message has been sent! You will receive your answer within 24 hours!",
            "unexpected": "Unexpected error on the server! Try again or use another way to contact me! We are happy to report the error as well ..."
        }
    },
    "fill_form_or_other_ways": "Fill out the form or use the communication methods below to contact me ...",
    "name": "Name",
    "phone": "Phone",
    "email": "Email",
    "message": "Message",
    "send_message": "Send Message",
    "contact_form": {
        "not_working": "Our contact form is not working at the moment ... contact us in other ways ..."
    },
    "footer": "©{year} Amirhossein Fazli | All rights reserved.",
    "source": "source"
}
