{
    "english": "انگلیسی",
    "persian": "فارسی",
    "my_name": "امیرحسین فضلی",
    "me": "من",
    "job": "برنامه نویس فول استک",
    "short_description": "من یک برنامه نویس فول استک هستم و برای اجرای ایده ی کسب و کاری شما آماده ام !",
    "about_me": "درباره من",
    "my_skills": "مهارت های من",
    "my_services": "خدمات من",
    "my_portfolios": "نمونه کار های من",
    "contact_me": "تماس با من",
    "about_1": "من از سال 1396 به صورت حرفه ای، شروع به یادگیری برنامه نویسی کرده ام و هنوز هم ادامه می دهم و این چرخه تا بی نهایت ادامه دارد ...",
    "about_2": "اوایل، با دوره های آنلاین ( آموزش های ویدئویی ) آموزش دیدم ... اما بعدا محدود به این منبع نشدم و از تمامی منابع اعم از ویدئو، متن، مستندات، ویدئو، وبلاگ ها و کتاب ها و ... در ادامه استفاده میکنم ...",
    "about_3": "برنامه نویسی با زبان Rust را خیلی دوست دارم. و دوست دارم بک اند وبسایت هایی را که مینویسم، با این زبان باشد ... این زبان، فوق العاده است !",
    "about_4": "دنیای اوپن سورس را خیلی دوست دارم. عاشق لینوکس هستم و با لینوکس برنامه نویسی میکنم ... زیرا آزادی عمل بیشتری را در اختیارم می گذارد ...",
    "fullname": "نام کامل",
    "age": "سن",
    "country": "کشور",
    "my_country": "ایران",
    "city": "شهر",
    "my_city": "آذربایجان شرقی - مرند",
    "address": "آدرس",
    "my_address": "بناب جدید - خیابان امام - کوی بخشمندی - ده متری اول - منزل فضلی",
    "status": "وضعیت",
    "my_status": "آماده",
    "languages": "زبان ها",
    "freamworks": "چارچوب ها",
    "databases": "پایگاه داده ها",
    "os": "سیستم عامل",
    "other": "سایر",
    "mobile": "موبایل",
    "bootstrap": {
        "title": "بوت استرپ",
        "value": "بهترین و پرطرفدار ترین کتابخانه رابط کاربری برای ساخت سریع و واکنشگرای سایت، بی شک بوت استرپ است ... این کتابخانه، فوق العاده قدرتمند و توسعه پذیر است و با Sass شخصی سازی می شود ..."
    },
    "javascript": {
        "title": "جاوااسکریپت",
        "value": "در همان ابتدا، این زبان را در فرانت اند یاد میگرفتم. اما بعدا در سطح پیشرفته، این زبان را یاد گرفتم و هم اکنون، هم در فرانت اند و هم در بک اند، استفاده میکنم ..."
    },
    "jquery": {
        "title": "جی کوئری",
        "value": "یکی از رایج ترین کتابخانه های جاوا اسکریپت است ... این کتابخانه شعار جالبی دارد که می گوید: کمتر بنوی، بیشتر انجام بده! حجم کدی که با این کتابخانه نوشته می شود، بسیار کمتر از VanillaJS یا همان جاوااسکریپت خام است ..."
    },
    "laravel": {
        "title": "لاراول",
        "value": "لاراول یک چارچوب وب فوق العاده قدرتمند است. این چارچوب، قدرت توسعه فوق العاده بالایی دارد ... به معنی واقعی کلمه، در کوتاه ترین زمان ممکن، می توان پیچیده ترین پروژه ها را با آن اجرا کرد ..."
    },
    "linux": {
        "title": "لینوکس",
        "value": "لینوکس، خانواده‌ای از سیستم‌عامل‌های منبع باز شبه یونیکس است ... توزیع هایی که از کرنل لینوکس استفاده می کنند، به معنی واقعی کلمه، برای توسعه دهندگان عالی هستند ... امنیت فوق العاده ای دارد ... تمامی ابزار های توسعه در آن به روز است و هر ابزاری که بخواهیم، در دسترس است ..."
    },
    "mysql": {
        "title": "MySql",
        "value": "یک دیتابیس متن باز و قدرتمند است که چندین سال از بهترین پایگاه ها بوده و آمار خوبی از خود به جای گذاشته است ... از زبان SQL برای کوئری های خود استفاده میکند و استفاده وسیعی در اپلیکیشن های وب نیز دارد ..."
    },
    "php": {
        "title": "پی اچ پی",
        "value": "اولین زبانی که وقتی وارد برنامه نویسی شدم یاد گرفتم، php است. به این دلیل که php روی سادگی متمرکز است و همچنین جامعه ی خیلی خوبی دارد. همچنین وبسایت های پیچیده را به راحتی می توان با این زبان دوست داشتنی، به راحتی پیاده کرد ..."
    },
    "postgresql": {
        "title": "Postgresql",
        "value": "یک دیتابیس فوق العاده قدرتمند، متن باز و کاملا رایگان ! این دیتابیس، امکانات خیلی خوبی دارد و از زبان SQL برای کوئری های خود استفاده میکند ... می‌تواند انواع اطلاعات پیشرفته را ذخیره کند و ویژگی های بهینه عملکردی عالی ای دارد که قابل قیاس به دیتابیس های گران قیمت است !"
    },
    "react": {
        "title": "ری اکت",
        "value": "برای ساخت ui های قدرتمند برای وب، از ری اکت استفاده میکنم. همچنین ری اکت به دلیل جامعه بزرگی که دارد، در خیلی از شرکت های معتبر در سر تا سر جهان نیز مورد استفاده قرار گرفته است ..."
    },
    "rust": {
        "title": "راست",
        "value": "این زبان رو در سال 1401 شروع به یادگیری کردم. به این دلیل این زبان را دوست دارم که علاوه بر اینکه یک زبان مدرن است، نرم افزار های امن و کارآمد تولید میکنه و اجازه مدیریت حافظه رو بهم میده. و همچنین پرفرمنسی قابل رقابت با C رو ارائه میده ..."
    },
    "sass": {
        "title": "Sass",
        "value": "Sass یک پیش پردازنده فوق العاده قدرتمند برای css است. در تمام پروژه هایی که می نویسم، از sass به جای css استفاده میکنم ... حجم کد فوق العاده کمتری دارد و با کمترین میزان کد نویسی، بیشترین کار ها را می توان انجام داد ..."
    },
    "svelte": {
        "title": "Svelte",
        "value": "svelte، یک کامپایلر فوق العاده است ! این کامپایلر ‌UI های قدرتمندی تولید میکند. خروجی ای که تولید میکند، فوق العاده سبک و کم حجم تر نسبت به رقبایش است ... من از این کامپایلر مدرن، برای تولید UI های سبک و کم حجم، در عین قدرت زیاد استفاده میکنم ..."
    },
    "tailwind": {
        "title": "Tailwind CSS",
        "value": "یک ابزار فوق العاده و دوست داشتنی برای استایل دهی که آنچه را که برای توسعه یک سایت جذاب و زیبا لازم است را فراهم می کند ... ما هیچ وقت چرخی که وجود دارد را دوباره اختراع نمیکنیم ... تیلویند، امکانات پایه ای لازم را برای ساختن theme فراهم میکند و توسعه را سریع تر می کند ..."
    },
    "typescript": {
        "title": "تایپ اسکریپت",
        "value": "اکثر مشکلاتی که در جاوااسکریپت وجود داشت، از تایپ ها ناشی می شد ... برای اینکه برنامه هایی تولید کنم که در آینده خطا های غیر منتظره نداشته باشد، از تایپ اسکریپت استفاده میکنم. تقریبا تمام پروژه هایی که میخواهم با جاوااسکریپت بنویسم را با این زبان می نویسم ..."
    },
    "vue": {
        "title": "ویو",
        "value": "Vue، یک چارچوب قدرتمند با اکوسیستم خیلی خوب است. توسعه آن آسان است و با آن می توان UI های قدرتمندی تولید کرد. من از این چارچوب در فرانت اند و اپلیکیشن های دسکتاپ استفاده میکنم ..."
    },
    "dart": {
        "title": "دارت",
        "value": "دارت، یک زبان فوق العاده قدرتمند برای ایجاد UI برای هر پلتفرمی شناخته می شد. من از این زبان و به کمک فریمورک فلاتر، اپلیکیشن های موبایل ( android & ios ) و همچنین اپلیکیشن های دسکتاپ ( windows & mac & linux ) می سازم."
    },
    "flutter": {
        "title": "فلاتر",
        "value": "Flutter یک چارچوب متن باز است که توسط گوگل برای ساخت اپلیکیشن های چند پلتفرمی ایجاد شده است. می توانید با کمترین هزینه، زیبا ترین اپلیکیشن موبایلی و دسکتاپ را داشته باشید و تجربه ای عالی برای کاربران خود ایجاد کنید!"
    },
    "wasm": {
        "title": "وب اسمبلی",
        "value": "وب اسمبلی، یک زبان سطح پایین است که با فرمت باینری در مرورگر اجرا می شود ... از ویژگی های بارز این زبان سریع بودن آن است ... من با زبان Rust، کد های فرانت اند وبسایت را می نویسم و از آن خروجی وب اسمبلی میگیرم ..."
    },
    "front_end": {
        "label": "فرانت اند",
        "description": "قالب وبسایت شما را به صورت واکنشگرا و کاربر پسند با ویژگی های دلخواه شما طراحی میکنیم ..."
    },
    "back_end": {
        "label": "بک اند",
        "description": "هسته و مغز وبسایت شما را با قالبی که دوست دارید، به صورت مقیاس پذیر و کارآمد می سازیم ..."
    },
    "telegram_bot": {
        "label": "ربات تلگرام",
        "description": "ربات های کاربردی و سفارشی را با توجه به نیاز شما را به بهترین شیوه های توسعه ربات طراحی میکنیم ..."
    },
    "mobile_service": {
        "label": "اپلیکیشن موبایل",
        "description": "برای نوشتن اپلیکیشن کسب و کار شما در پلتفرم های موبایلی اندروید و ios آماده ایم!"
    },
    "education": "تحصیلات",
    "diploma": {
        "label": "دیپلم",
        "description": "مدرک دیپلم خود را در مدرسه شهید بهشتی شهرستان مرند در رشته ی ریاضی و فیزیک دریافت کرده ام ..."
    },
    "2023": "1402",
    "validation_errors": {
        "name": {
            "required": "نوشتن نام الزامی است !"
        },
        "email": {
            "required": "نوشتن ایمیل الزامی است !",
            "invalid": "ایمیل نامعتبر است !"
        },
        "email_or_phone": "لطفا ایمیل یا شماره موبایل را بنویسید !",
        "phone": {
            "required": "نوشتن شماره موبایل الزامی است !"
        },
        "message": {
            "required": "نوشتن متن پیام الزامی است !"
        },
        "captcha": {
            "required": "حل کردن کپچا الزامی است !",
            "invalid": "کپچا نامعتبر است !"
        }
    },
    "form_contact": {
        "result": {
            "loading": "در حال ارسال ... لطفا چند لحظه منتظر بمانید ...",
            "success": "پیام شما ارسال شد! حداکثر تا 24 ساعت پاسخ تان را دریافت میکنید !",
            "unexpected": "خطای غیر منتظره در سرور! دوباره امتحان کنید یا از راه دیگری برای تماس با من استفاده کنید! خوشحال می شویم خطا را نیز گزارش کنید ..."
        }
    },
    "fill_form_or_other_ways": "فرم را پر کنید یا از راه های ارتباطی زیر برای تماس با من استفاده کنید ...",
    "name": "نام",
    "phone": "شماره موبایل",
    "email": "ایمیل",
    "message": "پیام",
    "send_message": "ارسال پیام",
    "contact_form": {
        "not_working": "در حال حاضر فرم تماس با ما کار نمی کند ... از راه های دیگر با ما تماس بگیرید ..."
    },
    "footer": "©{year} امیرحسین فضلی | تمامی حقوق محفوظ است.",
    "source": "منبع"
}
